import { Component } from '@angular/core';

@Component({
    selector: 'principles',
    templateUrl: './principles.component.html',
    styleUrls: ['./principles.component.css']
})
export class PrinciplesComponent{
    private section_title = 'كيفاش نكون مستهلك واعي ؟ '
    private principles = [
        {
            'title' : 'قاطع الغلاء ', 
            'description': 'م يكن، الأحد 6 أكتوبر 2019، تاريخ ثاني انتخابات تشريعية بعد ثورة 2011، يوما عاديا في جبل الجلود، إحدى أكبر و أقدم الأحياء الشعبية بالعاصمة. ففي حين قاطع أغلب الشباب معتبرين أن الوضع لن يتغير و أن كل الساسة كاذبون و أنهم أصل المأساة الإجتماعية و الإقتصادية التي يعيشونها، ذهب البعض الآخر إلى اختيار النهضة دعما لقيس سعيد .كما يبدو أن الكثير من النساء تناصرن نبيل القروي وحزبه قلب تونس. وشكك كلهم تقريباً في نزاهة هذه الانتخابات خاصةً في حضرة المال السياسي الذي توافق الجميع على تدفقه بكثرة في جبل جلود. نواة قضت هذا اليوم مع متساكني جبل الجلود حيث رصدت الكاميرا نقاشات حماسية وردود فعل تلقا'
        },
        {
            'title' : 'بلغ على التجاوزات ', 
            'description': 'م يكن، الأحد 6 أكتوبر 2019، تاريخ ثاني انتخابات تشريعية بعد ثورة 2011، يوما عاديا في جبل الجلود، إحدى أكبر و أقدم الأحياء الشعبية بالعاصمة. ففي حين قاطع أغلب الشباب معتبرين أن الوضع لن يتغير و أن كل الساسة كاذبون و أنهم أصل المأساة الإجتماعية و الإقتصادية التي يعيشونها، ذهب البعض الآخر إلى اختيار النهضة دعما لقيس سعيد .كما يبدو أن الكثير من النساء تناصرن نبيل القروي وحزبه قلب تونس. وشكك كلهم تقريباً في نزاهة هذه الانتخابات خاصةً في حضرة المال السياسي الذي توافق الجميع على تدفقه بكثرة في جبل جلود. نواة قضت هذا اليوم مع متساكني جبل الجلود حيث رصدت الكاميرا نقاشات حماسية وردود فعل تلقا'
        },
        {
            'title' : 'إستهلك تونسي', 
            'description': 'م يكن، الأحد 6 أكتوبر 2019، تاريخ ثاني انتخابات تشريعية بعد ثورة 2011، يوما عاديا في جبل الجلود، إحدى أكبر و أقدم الأحياء الشعبية بالعاصمة. ففي حين قاطع أغلب الشباب معتبرين أن الوضع لن يتغير و أن كل الساسة كاذبون و أنهم أصل المأساة الإجتماعية و الإقتصادية التي يعيشونها، ذهب البعض الآخر إلى اختيار النهضة دعما لقيس سعيد .كما يبدو أن الكثير من النساء تناصرن نبيل القروي وحزبه قلب تونس. وشكك كلهم تقريباً في نزاهة هذه الانتخابات خاصةً في حضرة المال السياسي الذي توافق الجميع على تدفقه بكثرة في جبل جلود. نواة قضت هذا اليوم مع متساكني جبل الجلود حيث رصدت الكاميرا نقاشات حماسية وردود فعل تلقا'
        }
    ]
}